{
    "id": 2250,
    "common_name": "melon",
    "scientific_name": [
        "Cucumis melo var. flexuosus"
    ],
    "other_name": [],
    "family": "Cucurbitaceae",
    "origin": [
        "India",
        "Pakistan"
    ],
    "type": "Fruit",
    "dimension": "6.00 to 9.00 feet",
    "dimensions": {
        "type": null,
        "min_value": 6,
        "max_value": 9,
        "unit": "feet"
    },
    "cycle": "Annual",
    "attracts": [],
    "propagation": [
        "Grafting Propagation",
        "Tissue Culture",
        "Air Layering Propagation",
        "Cutting",
        "Seed Propagation"
    ],
    "hardiness": {
        "min": "2",
        "max": "11"
    },
    "hardiness_location": {
        "full_url": "https://perenual.com/api/hardiness-map?species_id=2250&size=og&key=sk-MoaA6568e7e0852113224",
        "full_iframe": "<iframe frameborder=0 scrolling=yes seamless=seamless width=1000 height=550 style='margin:auto;' src='https://perenual.com/api/hardiness-map?species_id=2250&size=og&key=sk-MoaA6568e7e0852113224'></iframe>"
    },
    "watering": "Average",
    "depth_water_requirement": {
        "unit": "inch",
        "value": "1"
    },
    "volume_water_requirement": [],
    "watering_period": "morning",
    "watering_general_benchmark": {
        "value": "3-4",
        "unit": "days"
    },
    "plant_anatomy": [],
    "sunlight": [
        "Full sun"
    ],
    "pruning_month": null,
    "pruning_count": [],
    "seeds": 1,
    "maintenance": "Moderate",
    "care-guides": "http://perenual.com/api/species-care-guide-list?species_id=2250&key=sk-MoaA6568e7e0852113224",
    "section": [
        {
            "id": 10295,
            "type": "watering",
            "description": "Melons require at least 1 inch of water per week and should be watered deeply. If the plant is grown in a dry location or in a pot, it may need to be watered more frequently. The best time to water melons is in the morning, to give them time to dry off before the sun goes down. If your soil is heavy, the roots of the melon may not be able to access the water that you are providing, so try to water around the base of the plant. Watering should also be done slowly and thoroughly to allow the water to soak well into the soil."
        },
        {
            "id": 10296,
            "type": "sunlight",
            "description": "Melon plants (Cucumis melo var. flexuosus) require full sun exposure for at least 8-10 hours per day in order to grow and produce healthy fruits. During the hottest summer months, it is best to provide the plants with some partial shade from the intense heat during the midday hours. This will ensure that the plant does not become stressed due to excessive heat and allow it to continue to grow and produce healthy fruits."
        },
        {
            "id": 10297,
            "type": "pruning",
            "description": "Melon plants (Cucumis melo var. flexuosus) should be pruned regularly to maintain a desired shape and quantity of fruit. Pruning should be done shortly after transplanting, when the plant starts to form flowers and fruit. In the early stages of growth, remove or pinch off any lateral shoots that are developing from the leaf axils. This will encourage the production of stronger main stems and encourage new growth. In addition, you should remove weak or diseased branches and twigs.\n\nWhen the melon plant starts to produce flowers and fruit, continued pruning is needed. Cut off any vines that are larger than the main vines. Also remove laterals that are growing from the main vine if they are not blooming. As the melon fruits mature, flowering branch tips should be pinched off. Lastly, any remaining lateral foliage that is interfering with sunlight and air circulation should be pruned. \n\nMelon plants don’t require intense pruning, but rather a light and regular pruning schedule. Monitor your plant frequently to ensure that it is developing properly and receiving enough sunlight, air circulation, and adequate nutrients."
        }
    ],
    "soil": [],
    "growth_rate": "High",
    "drought_tolerant": false,
    "salt_tolerant": true,
    "thorny": true,
    "invasive": false,
    "tropical": false,
    "indoor": false,
    "care_level": "Medium",
    "pest_susceptibility": [
        "Mites",
        " Thrips",
        " Virus"
    ],
    "pest_susceptibility_api": "Coming Soon",
    "flowers": true,
    "flowering_season": "Spring",
    "flower_color": "Yellow",
    "cones": false,
    "fruits": true,
    "edible_fruit": true,
    "edible_fruit_taste_profile": "Coming Soon",
    "fruit_nutritional_value": "Coming Soon",
    "fruit_color": [
        "green",
        "yellow",
        "orange",
        "white"
    ],
    "harvest_season": "Summer",
    "leaf": true,
    "leaf_color": [
        "green"
    ],
    "edible_leaf": true,
    "cuisine": true,
    "medicinal": true,
    "poisonous_to_humans": 0,
    "poisonous_to_pets": 0,
    "description": "Melon (Cucumis melo var. flexuosus) is an amazing fruit that pleases everyone. It has a distinct flavour, sweet and juicy flesh that is highly aromatic. Moreover, melon is a great source of vitamins, minerals and dietary fibre. It also contains antioxidants which help to fight free radical damage and can reduce the risk of developing certain diseases. Furthermore, its water content helps to keep the body hydrated and its fibrous texture aids digestion. It can be eaten fresh, boiled, juiced or added to other dishes. Overall, its sweet flavour, nutritional content, versatility and low-calorie nature make it an ideal snack or treat.",
    "default_image": null,
    "other_images": "Upgrade Plan To Supreme For Access https://perenual.com/subscription-api-pricing. Im sorry"
}